Dataset/Kubernetes/31-05-24/15/hotelReservation/4/k8s-hr-wrk-mixed-c6525-25g-exp15-havail1-hori1-verti1-infi1-client-t8-c512-d30-R4000-N4
No argument supplied nginx
using  args: threads=8 and connections=512 and duration=30 and requests=4000
Running 30s test @ http://localhost:5000
  8 threads and 512 connections
  Thread calibration: mean lat.: 921.938ms, rate sampling interval: 4362ms
  Thread calibration: mean lat.: 905.771ms, rate sampling interval: 4620ms
  Thread calibration: mean lat.: 889.665ms, rate sampling interval: 4155ms
  Thread calibration: mean lat.: 925.627ms, rate sampling interval: 4538ms
  Thread calibration: mean lat.: 883.314ms, rate sampling interval: 4517ms
  Thread calibration: mean lat.: 970.086ms, rate sampling interval: 4710ms
  Thread calibration: mean lat.: 891.026ms, rate sampling interval: 4341ms
  Thread calibration: mean lat.: 957.380ms, rate sampling interval: 4648ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.90s     1.88s    8.27s    67.63%
    Req/Sec   446.28     29.46   511.00     68.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.62s 
 75.000%    4.03s 
 90.000%    5.51s 
 99.000%    8.27s 
 99.900%    9.78s 
 99.990%   10.73s 
 99.999%   11.03s 
100.000%   11.04s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.693     0.000000            1         1.00
     631.807     0.100000         7068         1.11
    1239.039     0.200000        14144         1.25
    1721.343     0.300000        21211         1.43
    2179.071     0.400000        28278         1.67
    2621.439     0.500000        35365         2.00
    2863.103     0.550000        38889         2.22
    3125.247     0.600000        42432         2.50
    3401.727     0.650000        45938         2.86
    3706.879     0.700000        49498         3.33
    4030.463     0.750000        53014         4.00
    4214.783     0.775000        54777         4.44
    4427.775     0.800000        56563         5.00
    4657.151     0.825000        58333         5.71
    4919.295     0.850000        60090         6.67
    5185.535     0.875000        61856         8.00
    5337.087     0.887500        62738         8.89
    5505.023     0.900000        63611        10.00
    5656.575     0.912500        64505        11.43
    5836.799     0.925000        65385        13.33
    6057.983     0.937500        66264        16.00
    6209.535     0.943750        66706        17.78
    6352.895     0.950000        67140        20.00
    6541.311     0.956250        67585        22.86
    6742.015     0.962500        68028        26.67
    6983.679     0.968750        68474        32.00
    7118.847     0.971875        68692        35.56
    7266.303     0.975000        68908        40.00
    7421.951     0.978125        69131        45.71
    7622.655     0.981250        69352        53.33
    7847.935     0.984375        69572        64.00
    7950.335     0.985938        69685        71.11
    8073.215     0.987500        69792        80.00
    8196.095     0.989062        69902        91.43
    8314.879     0.990625        70012       106.67
    8454.143     0.992188        70122       128.00
    8536.063     0.992969        70178       142.22
    8642.559     0.993750        70236       160.00
    8732.671     0.994531        70291       182.86
    8830.975     0.995313        70342       213.33
    8986.623     0.996094        70400       256.00
    9068.543     0.996484        70427       284.44
    9191.423     0.996875        70454       320.00
    9289.727     0.997266        70480       365.71
    9396.223     0.997656        70509       426.67
    9510.911     0.998047        70535       512.00
    9551.871     0.998242        70551       568.89
    9601.023     0.998437        70563       640.00
    9641.983     0.998633        70580       731.43
    9707.519     0.998828        70591       853.33
    9805.823     0.999023        70604      1024.00
    9830.399     0.999121        70611      1137.78
    9871.359     0.999219        70618      1280.00
    9912.319     0.999316        70626      1462.86
    9969.663     0.999414        70632      1706.67
   10092.543     0.999512        70639      2048.00
   10141.695     0.999561        70642      2275.56
   10199.039     0.999609        70647      2560.00
   10248.191     0.999658        70649      2925.71
   10330.111     0.999707        70653      3413.33
   10371.071     0.999756        70656      4096.00
   10461.183     0.999780        70658      4551.11
   10485.759     0.999805        70660      5120.00
   10493.951     0.999829        70661      5851.43
   10633.215     0.999854        70663      6826.67
   10731.519     0.999878        70667      8192.00
   10731.519     0.999890        70667      9102.22
   10731.519     0.999902        70667     10240.00
   10731.519     0.999915        70667     11702.86
   10739.711     0.999927        70669     13653.33
   10739.711     0.999939        70669     16384.00
   10756.095     0.999945        70670     18204.44
   10756.095     0.999951        70670     20480.00
   10756.095     0.999957        70670     23405.71
   11034.623     0.999963        70672     27306.67
   11034.623     0.999969        70672     32768.00
   11034.623     0.999973        70672     36408.89
   11034.623     0.999976        70672     40960.00
   11034.623     0.999979        70672     46811.43
   11034.623     0.999982        70672     54613.33
   11034.623     0.999985        70672     65536.00
   11042.815     0.999986        70673     72817.78
   11042.815     1.000000        70673          inf
#[Mean    =     2896.378, StdDeviation   =     1878.885]
#[Max     =    11034.624, Total count    =        70673]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  103028 requests in 30.07s, 38.66MB read
  Non-2xx or 3xx responses: 62152
Requests/sec:   3426.61
Transfer/sec:      1.29MB